In [9]:
# import dependencies
import pandas as pd
from sqlalchemy import create_engine
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
import psycopg2 as lily
import string

In [12]:
# clean the alldata.csv based on following Position
alldata_df = pd.read_csv("Resources/alldata(clean).csv")
alldata_df

,Position,Company,Location
0,An Ostentatiously-Excitable Principal Research...,The Hexagon Lavish,"Atlanta, GA"
1,Data Scientist,Xpert Staffing,"Atlanta, GA"
2,Data Analyst,Operation HOPE,"Atlanta, GA 30303"
3,Manager of Data Engineering,McKinsey & Company,"Atlanta, GA 30318"
4,"Junior to Mid-level Engineer, Geologist or Env...",Wood,"Atlanta, GA"
...,...,...,...
4629,Data Developer / Machine Learning Analyst,NetApp,"Sunnyvale, CA"
4630,Scientist I,"Pharmacyclics, an Abbvie Company","Sunnyvale, CA"
4631,Intern Scientist,Oath Inc,"Sunnyvale, CA"
4632,Senior Data & Applied Scientist,Microsoft,"Sunnyvale, CA"
4633,"Principal Data Scientist, Deep Learning",Comcast,"Sunnyvale, CA 94089"

In [15]:
datascientist_df = pd.read_csv("Resources/datascientist(clean).csv")
datascientist_df

,Index,Position,Salary Estimate,Rating,Company,Location,Industry
0,0,Senior Data Scientist,$111K-$181K (Glassdoor est.),3.5,Hopper\n3.5,"New York, NY",Travel Agencies
1,1,"Data Scientist, Product Analytics",$111K-$181K (Glassdoor est.),4.5,Noom US\n4.5,"New York, NY","Health, Beauty, & Fitness"
2,2,Data Science Manager,$111K-$181K (Glassdoor est.),-1.0,Decode_M,"New York, NY",-1
3,3,Data Analyst,$111K-$181K (Glassdoor est.),3.4,Sapphire Digital\n3.4,"Lyndhurst, NJ",Internet
4,4,"Director, Data Science",$111K-$181K (Glassdoor est.),3.4,United Entertainment Group\n3.4,"New York, NY",Advertising & Marketing
...,...,...,...,...,...,...,...
3904,4375,AWS Data Engineer,$55K-$112K (Glassdoor est.),4.4,Tachyon Technologies\n4.4,"Dublin, OH",IT Services
3905,4376,Data Analyst â Junior,$55K-$112K (Glassdoor est.),5.0,"Staffigo Technical Services, LLC\n5.0","Columbus, OH",IT Services
3906,4377,Security Analytics Data Engineer,$55K-$112K (Glassdoor est.),3.8,"PDS Tech, Inc.\n3.8","Dublin, OH",Staffing & Outsourcing
3907,4378,Security Analytics Data Engineer,$55K-$112K (Glassdoor est.),4.0,Data Resource Technologies\n4.0,"Dublin, OH",Accounting
3908,4379,Patient Safety Physician or Safety Scientist -...,$55K-$112K (Glassdoor est.),3.7,UCB\n3.7,"Slough, OH",Biotech & Pharmaceuticals

In [16]:
#Removing punctuations before we call DB functions
alldata_df["Position"]=alldata_df["Position"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))
alldata_df["Company"]=alldata_df["Company"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))
alldata_df["Location"]=alldata_df["Location"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))

datascientist_df["Position"]=datascientist_df["Position"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))
datascientist_df["Company"]=datascientist_df["Company"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))
datascientist_df["Location"]=datascientist_df["Location"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))
datascientist_df["Industry"]=datascientist_df["Industry"].apply(lambda z: z.translate(str.maketrans('', '', string.punctuation)))

In [18]:
#connect to database
def execute_sql_statement(sqltext):
    conn=lily.connect( host="localhost", database="ELT_project", user="postgres", password="Abcd1234")
#cursor is an object to put watever you want
    cursor=conn.cursor()
#xecute() method
    cursor.execute(sqltext)
    conn.commit()
#Closing the connection
    conn.close()

#from config import sqldb_connect
#engine = create_engine(sqldb_connect)

In [19]:
#Dropping all tables gathered 
execute_sql_statement("DROP TABLE IF EXISTS alldata,datascientist,company,location,industry,position CASCADE;")

In [20]:
#database tables
#Creating table as per requirement 
sql ='''CREATE TABLE company( id INT GENERATED ALWAYS AS IDENTITY, name VARCHAR(255) NOT NULL, PRIMARY KEY(id))''' 
execute_sql_statement(sql)
print("Table created successfully........") 
#Closing the connection conn.close()

Table created successfully........

In [22]:
#Creating table as per requirement 
sql ='''CREATE TABLE position( id INT GENERATED ALWAYS AS IDENTITY, name VARCHAR(255) NOT NULL, PRIMARY KEY(id))''' 
execute_sql_statement(sql)
print("Table created successfully........")

Table created successfully........

In [23]:
#Creating table as per requirement 
sql ='''CREATE TABLE location( id INT GENERATED ALWAYS AS IDENTITY, name VARCHAR(255) NOT NULL, PRIMARY KEY(id) )''' 
execute_sql_statement(sql)
print("Table created successfully........")

Table created successfully........

In [24]:
#Creating for all data
#Creating table as per requirement 
sql ='''CREATE TABLE alldata( id INT GENERATED ALWAYS AS IDENTITY,
positionid INT, 
companyid INT, 
locationid INT, 
PRIMARY KEY(id),
CONSTRAINT fk_Pos_id FOREIGN KEY(positionid) REFERENCES position(id),
CONSTRAINT fk_Comp_id FOREIGN KEY(companyid) REFERENCES company(id),
CONSTRAINT fk_Loc_id FOREIGN KEY(locationid) REFERENCES location(id))'''
execute_sql_statement(sql)
print("Table created successfully........")

Table created successfully........

In [25]:
#Tables for Data scientist 
#Creating table as per requirement 
sql ='''CREATE TABLE industry( id INT GENERATED ALWAYS AS IDENTITY, name VARCHAR(255) NOT NULL, PRIMARY KEY(id) )''' 
execute_sql_statement(sql)
print("Table created successfully........")

Table created successfully........

In [26]:
#Creating table as per requirement 
sql ='''CREATE TABLE datascientist(id INT GENERATED ALWAYS AS IDENTITY, 
positionid INT, 
companyid INT, 
locationid INT,  
industryid INT, 
rating decimal, 
salary_estimate VARCHAR(255), 
PRIMARY KEY(id), 
CONSTRAINT fk_pos_1 FOREIGN KEY(positionid) REFERENCES Position(ID) ON DELETE CASCADE, 
CONSTRAINT fk_comp_1 FOREIGN KEY(companyid) REFERENCES Company(ID) ON DELETE CASCADE, 
CONSTRAINT fk_loc_1 FOREIGN KEY(locationid) REFERENCES Location(ID) ON DELETE CASCADE, 
CONSTRAINT fk_indus FOREIGN KEY(industryid) REFERENCES Industry(ID) ON DELETE CASCADE)''' 
execute_sql_statement(sql)
print("Table created successfully........")

Table created successfully........

In [28]:
#Insert Data
#Create Engine and connection to Database
engine = create_engine('postgresql://postgres:Abcd1234@localhost:5432/ELT_project')

In [29]:
alldata_df.to_sql("all_data_df",engine,if_exists="replace")

In [30]:
datascientist_df.to_sql("datascientist_df",engine,if_exists="replace")

In [31]:
#Normalizing data
df_position=pd.DataFrame((pd.concat([alldata_df.Position,datascientist_df.Position],axis=0)).unique())
df_position.columns=["name"]
df_position.to_sql("position",engine,if_exists="append",index=False)

In [32]:
df_Location=pd.DataFrame((pd.concat([alldata_df.Location,datascientist_df.Location],axis=0)).unique())
df_Location.columns=["name"]
df_Location.to_sql("location",engine,if_exists="append",index=False)

In [33]:
df_Industry=pd.DataFrame(datascientist_df.Industry.unique())
df_Industry.columns=["name"]
df_Industry.to_sql("industry",engine,if_exists="append",index=False)

In [34]:
#We combined all data and data scientist together to get the unique value
df_Company=pd.DataFrame((pd.concat([alldata_df.Company,datascientist_df.Company],axis=0)).unique())
df_Company.columns=["name"]
df_Company.to_sql("company",engine,if_exists="append",index=False)

In [37]:
#Create a function to creat a sql for PositionID,companyID and LocationID
def insert_for_alldata(pos_name,loc_name,comp_name):
    sql='''insert into alldata(positionid, companyid, locationid) select p.id,c.id,l.id from position p,location l, company c where p.name=\''''+pos_name+'''\' and l.name=\''''+loc_name+'''\' and c.name=\''''+comp_name+'\''
    execute_sql_statement(sql)
    return "success"

In [38]:
for index, row in alldata_df.iterrows():
    insert_for_alldata(row['Position'], 
                       row['Location'],
                       row['Company'])

In [39]:
#Create a function to creat a sql for PositionID,companyID and LocationID
def insert_for_datascientist(pos_name,loc_name,comp_name,ind_name,rating,salary_estimate):
    sql='''insert into datascientist(positionid, companyid, locationid, industryid,rating,salary_estimate) select p.id,c.id,l.id,ind.id, '''+str(rating)+ ', \''+salary_estimate+'''\' from position p,location l, company c, industry ind where p.name=\''''+pos_name+'''\' and l.name=\''''+loc_name+'''\' and c.name=\''''+comp_name+'''\' and ind.name=\''''+ind_name+'\''
    execute_sql_statement(sql)
    return "success"

In [40]:
for index, row in datascientist_df.iterrows():
    insert_for_datascientist(row['Position'],row['Location'],row['Company'],
                            row['Industry'],row['Rating'],row['Salary Estimate'])